---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LossFactor.Dispose
source: html/510d136d-864f-2b61-ad9c-65560914d539.htm
---
# Autodesk.Revit.DB.Lighting.LossFactor.Dispose Method

Releases all resources used by the LossFactor

## Syntax (C#)
```csharp
public void Dispose()
```